import * as React from "react";

// interface Props {
//   myref:
//     | string
//     | ((instance: HTMLDivElement | null) => void)
//     | RefObject<HTMLDivElement>
//     | null
//     | undefined;
// }

export function PDF1Certificate() {
  return (
    <div id="pdf1page1">
      <p>
        श्रीमान् ईन्जिनियर ज्यु,
        <br />
        मध्यपुर ठिमि न. पा., कार्यालय
        <br />
        मध्यपुर ठिमि, भक्तपुर
      </p>
      <p>बिषयः निर्माण सम्पन्न प्रमाण&ndash;पत्र पाउँ</p>
      <p>
        महोदय, <br />
        उपरोक्त सम््बन््धमा मैले हामीले मध्यपुर ठिमी न पा वडा नं साबिक गा वि स
        वडा नं कि नं क्षेत्रफल जग्गा मिती मा नक्सा पास गरी सो घर पखाल टहरा
        बनाउँदै आएकोमा हाल पास नक्सा बमोजिम निर्माण कार्य पुरा भैसकेको हुँदा सो
        को निर्माण सम्पन्न प्रमाण्(पत्र उपलब्ध गराइ पाउँ भनि श्रीमान् समक्ष पेश
        गरेको छु छौँ
      </p>
      <p>
        निबेदक निबेदिका <br />
        नाम ः<br />
        सहि ः
      </p>
      <p>
        संलग्न कागजातहरु ः<br />
        १) पास भएको नक्सा फोटोकपि .................... १ प्रति
        <br />
        २) नक्शा पास प्रमाण&ndash;पत्रको फोटोकपि .............१ प्रति
        <br />
        ३) डिजाईनरको सिफारिस पत्र .......................१ प्रति
        <br />
        ४) डिजाईनरका इजाजत् पत्र ........................ १ प्रति
        <br />
        ५) पासपोर्ट साइजको फोटो .......................... १ प्रति
        <br />
        ६) घर जग्गा कर फुकुवा पत्रको फोटोकपि ..... १ प्रति
      </p>
    </div>
  );
}
